#!/bin/echo It's a library file

##.###########################################################################.
##! Copyright (C) Марков Евгений 2022
##!
##! \file   em_lib_xorg_current_wp.sh
##! \author Марков Евгений <upirtf@gmail.com>
##! \date   2022-02-14 Пн 21:52
##!
##! \brief  X-org. Получить текущий workspace.
##|
##'###########################################################################'



# :BEGIN:

##.***************************************************************************.
##| Lib: xorg/em_lib_xorg_current_wp.sh
##|
##'***************************************************************************'

EM_LIB_CHECK_CMD="${EM_LIB_CHECK_CMD} wmctrl"

##.================================================================.
##! \brief Получить текущий workspace.
##!
##! \return  - stdout :
##!                 номер workspace-а (0, 1 ...).
##|
##'================================================================'
em_lib_xorg_current_wp () {

    wmctrl -d|sed -n 's/^\([0-9]\+\)[ \t]\+\*.*/\1/gp'
}
#export -f em_lib_xorg_current_wp



# :END:
