#!/bin/echo It's a library file

##.###########################################################################.
##! Copyright (C) Марков Евгений 2022
##!
##! \file   em_lib_xorg_get_win_focus.sh
##! \author Марков Евгений <upirtf@gmail.com>
##! \date   2022-02-14 Пн 21:52
##!
##! \brief  X-org. Получить WID окна с фокусом.
##|
##'###########################################################################'



# :BEGIN:

##.***************************************************************************.
##| Lib: xorg/em_lib_xorg_get_win_focus.sh
##|
##'***************************************************************************'

EM_LIB_CHECK_CMD="${EM_LIB_CHECK_CMD} xdotool"

##.================================================================.
##! \brief Получить WID окна с фокусом.
##!
##! \param $1 - формат представления WID (команда printf).
##!
##! \return  - stdout :
##!                 WID.
##|
##'================================================================'
em_lib_xorg_get_win_focus () {

    local fmt="%d"

    [ -n "${1}" ] && fmt="${1}"
    printf "${fmt}" $(xdotool getwindowfocus)
}
#export -f em_lib_xorg_get_win_focus



# :END:
