#!/bin/echo It's a library file

##.###########################################################################.
##! Copyright (C) Марков Евгений 2023
##!
##! \file    em_lib_xorg_get_geom.sh
##! \author Марков Евгений <upirtf@gmail.com>
##! \date   2023-01-13 16:50
##!
##! \brief  Разбор строки geometry.
##|
##'###########################################################################'


# :BEGIN:
##.***************************************************************************.
##| Lib: xorg/em_lib_xorg_get_geom.sh
##|
##'***************************************************************************'

##.================================================================.
##! \brief Разбор строки geometry.
##!
##! \param $1 - geometry string (WxH+-X+-Y или WxH).
##!
##! \return  - return code :
##!                 0 - строка соответствует спецификации;
##!                 1 - строка не соответствует спецификации;
##!            stdout : строка вида "W H +-X +-Y" или "W H"
##|
##'================================================================'
em_lib_xorg_get_geom () {
    local g
       
    g=$(echo "${1}"|sed -n 's/^\([0-9]\+\)x\([0-9]\+\)\(+\?[-+]\?[0-9]*\)\(+\?[-+]\?[0-9]*\)/\1 \2 \3 \4/gp')
    echo "${g}"
    [ -n "${g}" ] && return 0; return 1
}
#export -f em_lib_xorg_get_geom



# :END:
