#!/bin/echo It's a library file

#.############################################################################.
##! Copyright (C) Марков Евгений 2019
##!
##! \file   em-source.sh
##! \author Марков Евгений <upirtf@gmail.com>
##! \date   2019-03-28 23:08
##!
##! \brief  Sourcing.
##|
##'###########################################################################'



##.===========================================================================.
##! \brief Sourcing.
##!
##! \param $1 - path to source.
##|
##'==========================================================================='
em_source () {
    local cdir="$(pwd)"
    local fn="$(echo "${1}"|sed 's#^\(.*/\)\?\([^/]*\)#\2#')"
    local dn="$(echo "${1}"|sed "s#${fn}##;s#^\$#./#;s#//*#/#g")"
    # cd "$(dirname "${1}")"
    cd "${dn}"
    # source "./$(basename "${1}")"
    source "./${fn}"
    cd "${cdir}"
}
export -f em_source
